ShowActiveWorkPlane Method
Show the active work plane of the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void ShowActiveWorkPlane()
Visual Basic
Public Sub ShowActiveWorkPlane
Visual C++
public:
void ShowActiveWorkPlane()
Remarks
If this method is invoked while the current work plane is hidden, only the outline of the updated work plane will be shown immediately. The updated sketch plane will be shown fully after the current transaction is committed. Therefore it is recommended the Add-On commits the transaction before performing UI operations (for example, PickPoint).
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException | Thrown when there is no active sketch plane, or when an error occurs during setting the sketch plane visibility.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →